---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.NotAllGroupsFullyRestored
source: html/db796924-c897-93d3-1232-f98152ba8b19.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.NotAllGroupsFullyRestored Property

Not all of the excluded members of the select groups were fully restored. You may be able to restore the remaining members individually
 or by performing "restore all excluded members" on sub-groups of the selected groups.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotAllGroupsFullyRestored { get; }
```